cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32main/main.cpp
    .overlay {
      position: fixed;
      top: 0; left: 0; width: 100%; height: 100%;
      background: rgba(11, 12, 17, 0.96);
      z-index: 9999;
      display: flex; flex-direction: column; justify-content: center; align-items: center;
      display: none;
    }
    .spinner {
      width: 44px; height: 44px;
      border: 3px solid rgba(255, 255, 255, 0.08);
      border-top: 3px solid var(--primary);
      border-radius: 50%;
      animation: spin 1s linear infinite;
      margin-bottom: 16px;
    }
    @keyframes spin { 0% { transform: rotate(0deg); } 100% { transform: rotate(360deg); } }
    .overlay h2 { margin: 0 0 6px 0; font-size: 18px; font-weight: 600; }
    .overlay p { margin: 0; color: var(--text-muted); font-size: 13px; }
    
    .toast {
      position: fixed;
      bottom: 20px; right: 20px;
      background: rgba(22, 25, 41, 0.96);
      border: 1px solid var(--success);
      border-radius: 8px;
      padding: 10px 20px;
      color: #ffffff;
      box-shadow: 0 8px 24px rgba(0,0,0,0.5);
      display: flex; align-items: center; gap: 8px;
      transform: translateY(100px); opacity: 0;
      transition: transform 0.3s, opacity 0.3s;
      font-size: 13px;
      z-index: 999;
    }
    .toast.show { transform: translateY(0); opacity: 1; }

    /* ── Landscape Mobile (tinggi layar < 500px) ── */
    @media (max-height: 500px) and (orientation: landscape) {
      .app-container { padding: 10px 14px; }
      header { margin-bottom: 10px; padding-bottom: 8px; }
      .brand h1 { font-size: 15px; }
      .brand p { display: none; }
      .badge { padding: 3px 8px; font-size: 10px; }
      .dashboard-grid { grid-template-columns: repeat(2, 1fr); }
      .dash-section { padding: 0 12px; }
      .firmware-grid { gap: 10px; }
      .settings-grid { gap: 10px; }
      .card { padding: 12px 14px; border-radius: 10px; }
      .card:hover { transform: none; box-shadow: none; }
      .card-title { font-size: 12.5px; margin-bottom: 8px; padding-bottom: 6px; gap: 6px; }
      .card-title svg { width: 14px; height: 14px; }
      .status-list { gap: 7px; }
      .status-item { font-size: 12px; }
      .mono { font-size: 11px; padding: 1px 5px; }
      .btn { padding: 7px 12px; font-size: 12px; }
      .form-group { margin-bottom: 8px; }
      .form-group label { font-size: 10px; margin-bottom: 3px; }
      .form-control { padding: 7px 10px; font-size: 12px; }
      .control-row { gap: 8px; }
    }

    /* ── Tablet (< 900px) ── */
    @media (max-width: 900px) {
      .dashboard-grid { grid-template-columns: repeat(2, 1fr); }
      .dash-section:nth-child(2) { border-right: none; padding-right: 0; }
      .dash-section:nth-child(3) { padding-left: 0; border-right: 1px solid rgba(255,255,255,0.07); padding-top: 16px; }
      .dash-section:nth-child(4) { padding-top: 16px; }
      .settings-grid { grid-template-columns: 1fr; }
    }

    /* ── Portrait Mobile (lebar < 600px) ── */
    @media (max-width: 600px) {
      .app-container { padding: 14px; }
      header { flex-direction: column; align-items: flex-start; gap: 8px; }
      .dashboard-grid { grid-template-columns: 1fr; }
      .dash-section { padding: 0; border-right: none; border-top: 1px solid rgba(255,255,255,0.06); padding-top: 14px; margin-top: 14px; }
      .dash-section:first-child { border-top: none; padding-top: 0; margin-top: 0; }
      .firmware-grid { grid-template-columns: 1fr; }
      .firmware-divider { padding-left: 0; border-left: none; border-top: 1px solid rgba(255,255,255,0.07); padding-top: 20px; margin-top: 16px; }
      .settings-grid { grid-template-columns: 1fr; }
      .section-divider { padding-left: 0; border-left: none; border-top: 1px solid rgba(255,255,255,0.07); padding-top: 20px; margin-top: 16px; }
    }
  </style>
</head>
<body>
  <div class="app-container">
    <header>
      <div class="brand">
        <h1>🏢 Wanara Seta Gate Portal</h1>
        <p>Sistem Gate Controller ESP32 S4 38-Pin</p>
      </div>
      <div class="badge-group">
        <span class="badge badge-primary">Firmware v<span id="version-text">{{VERSION}}</span></span>
        <span class="badge" id="folder-badge">{{FOLDER}}</span>
      </div>
    </header>

    <!-- Card 1: Dashboard Status Lengkap -->
    <div class="card" style="margin-bottom:16px;">
      <div class="dashboard-grid">

        <div class="dash-section">
          <div class="dash-section-title">
            <svg fill="none" stroke="currentColor" stroke-width="2" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path stroke-linecap="round" stroke-linejoin="round" d="M9 3v2m6-2v2M9 19v2m6-2v2M5 9H3m2 6H3m18-6h-2m2 6h-2M7 19h10a2 2 0 002-2V7a2 2 0 00-2-2H7a2 2 0 00-2 2v10a2 2 0 002 2zM9 9h6v6H9V9z"></path></svg>
            Hardware & Sistem
          </div>
          <div class="status-list">
            <div class="status-item">
              <span class="status-label">Uptime</span>
              <span class="status-value mono" id="uptime">Loading...</span>
            </div>
            <div class="status-item">
              <span class="status-label">Free Heap RAM</span>
              <span class="status-value mono" id="free-heap">Loading...</span>
            </div>
            <div class="status-item">
              <span class="status-label">Min Free Heap</span>
              <span class="status-value mono" id="min-free-heap">Loading...</span>
            </div>
          </div>
          <button class="btn btn-secondary btn-danger" onclick="rebootDevice()" style="margin-top:14px;width:100%;">
            <svg fill="none" stroke="currentColor" stroke-width="2" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg" style="width:14px;height:14px;"><path stroke-linecap="round" stroke-linejoin="round" d="M11.25 11.25l.041-.02a.75.75 0 111.086 1.086L10.5 14.25h3.75a4.5 4.5 0 010 9H8.25m.75-12h-.008v-.008H9v.008z"></path></svg>
            Reboot Board
          </button>
        </div>

        <div class="dash-section">
          <div class="dash-section-title">
            <svg fill="none" stroke="currentColor" stroke-width="2" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path stroke-linecap="round" stroke-linejoin="round" d="M15 7a2 2 0 012 2m4 0a6 6 0 01-7.743 5.743L11 17H9v2H7v2H4a1 1 0 01-1-1v-2.586a1 1 0 01.293-.707l5.964-5.964A6 6 0 1121 9z"></path></svg>
            RFID & Barcode
          </div>
          <div class="status-list">
            <div class="status-item">
              <span class="status-label">RFID Status</span>
              <span class="status-value text-green" id="rfid-status-val">
                <span class="status-indicator indicator-green" id="rfid-status-ind"></span>
                Loading...
              </span>
            </div>
            <div class="status-item">
              <span class="status-label">Versi PCD</span>
              <span class="status-value mono" id="rfid-version">Loading...</span>
            </div>
            <div class="status-item">
              <span class="status-label">UID Terakhir</span>
              <span class="status-value mono" id="last-rfid" style="color:#6366f1;">Belum ada kartu</span>
            </div>
          </div>
          <div style="margin-top:12px;padding-top:10px;border-top:1px solid rgba(255,255,255,0.05);">
            <div class="status-list">
              <div class="status-item">
                <span class="status-label">Barcode Status</span>
                <span class="status-value text-green" id="barcode-status-val">
                  <span class="status-indicator indicator-green" id="barcode-status-ind"></span>
                  ✅ AKTIF
                </span>
              </div>
              <div class="status-item">
                <span class="status-label">Barcode Terakhir</span>
                <span class="status-value mono" id="last-barcode" style="color:#10b981;">Belum ada barcode</span>
              </div>
            </div>
          </div>
        </div>

