cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32main/main.cpp
        <div class="dash-section">
          <div class="dash-section-title">
            <svg fill="none" stroke="currentColor" stroke-width="2" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path stroke-linecap="round" stroke-linejoin="round" d="M3.055 11H5a2 2 0 012 2v1a2 2 0 002 2 2 2 0 012 2v2.945M8 3.935V5.5A2.5 2.5 0 0010.5 8h.5a2 2 0 012 2 2 2 0 002 2h2m-4-3h1.286a2 2 0 00.707-.13l1.581-.79a2 2 0 00.41-.318l1.361-1.36a2 2 0 00.318-.41L21 6.5"></path></svg>
            Koneksi & MQTT
          </div>
          <div class="status-list">
            <div class="status-item">
              <span class="status-label">Koneksi WiFi</span>
              <span class="status-value text-green" id="wifi-status-val">
                <span class="status-indicator indicator-green" id="wifi-status-ind"></span>
                Loading...
              </span>
            </div>
            <div class="status-item">
              <span class="status-label">SSID WiFi</span>
              <span class="status-value mono" id="wifi-ssid">Loading...</span>
            </div>
            <div class="status-item">
              <span class="status-label">Kekuatan Sinyal</span>
              <span class="status-value mono" id="wifi-rssi">Loading...</span>
            </div>
            <div class="status-item">
              <span class="status-label">IP Board</span>
              <span class="status-value mono" id="wifi-ip">Loading...</span>
            </div>
            <div class="status-item">
              <span class="status-label">EMQX Broker</span>
              <span class="status-value text-green" id="mqtt-status-val">
                <span class="status-indicator indicator-green" id="mqtt-status-ind"></span>
                Loading...
              </span>
            </div>
            <div class="status-item">
              <span class="status-label">Alamat Broker</span>
              <span class="status-value mono" id="mqtt-broker">Loading...</span>
            </div>
            <div class="status-item">
              <span class="status-label">Client ID</span>
              <span class="status-value mono" id="mqtt-client-id">Loading...</span>
            </div>
            <div class="status-item">
              <span class="status-label">Tipe Device</span>
              <span class="status-value mono" id="device-type-val">Loading...</span>
            </div>
            <div class="status-item" style="flex-direction:column;align-items:flex-start;gap:3px;">
              <span class="status-label">📤 Publish Topic</span>
              <span class="status-value mono" id="topic-pub-val" style="color:#10b981;font-size:11px;word-break:break-all;">Loading...</span>
            </div>
            <div class="status-item" style="flex-direction:column;align-items:flex-start;gap:3px;">
              <span class="status-label">📥 Subscribe Topic</span>
              <span class="status-value mono" id="topic-sub-val" style="color:#a5b4fc;font-size:11px;word-break:break-all;">Loading...</span>
            </div>
          </div>
        </div>

        <div class="dash-section">
          <div class="dash-section-title">
            <svg fill="none" stroke="currentColor" stroke-width="2" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path stroke-linecap="round" stroke-linejoin="round" d="M8 11V7a4 4 0 118 0m-4 8v2m-6 4h12a2 2 0 002-2v-6a2 2 0 00-2-2H6a2 2 0 00-2 2v6a2 2 0 002 2z"></path></svg>
            Relay Gerbang
          </div>
          <div class="status-list">
            <div class="status-item">
              <span class="status-label">Gerbang 1 (R1 — GPIO 2)</span>
              <span class="status-value text-muted" id="r1-status">⚡ STANDBY</span>
            </div>
            <div class="status-item">
              <span class="status-label">Gerbang 2 (R2 — GPIO 27)</span>
              <span class="status-value text-muted" id="r2-status">⚡ STANDBY</span>
            </div>
          </div>
          <div style="margin-top:14px;display:flex;flex-direction:column;gap:8px;">
            <button class="btn" onclick="triggerRelay(1)">🔓 Buka Gerbang 1 (R1)</button>
            <button class="btn btn-secondary" onclick="triggerRelay(2)">🔓 Buka Gerbang 2 (R2)</button>
          </div>
          <div style="margin-top:16px;padding-top:12px;border-top:1px solid rgba(255,255,255,0.05);">
            <div class="control-row">
              <button class="btn btn-secondary" onclick="reconnectWifi()" style="font-size:11px;padding:6px;">🔄 Reconnect WiFi</button>
              <button class="btn btn-secondary btn-danger" onclick="forgetWifi()" style="font-size:11px;padding:6px;">🗑️ Lupakan WiFi</button>
            </div>
            <div class="status-item" style="margin-top:10px;">
              <span class="status-label">Reset via Touch</span>
              <span class="status-value mono text-orange" id="touch-status-val" style="font-size:11px;">GPIO4 — tahan 10 dtk</span>
            </div>
          </div>
        </div>

      </div>
    </div>

    <!-- Card 2: Update Firmware -->
    <div class="card" style="margin-bottom:16px;">
      <h3 class="card-title">
        <svg fill="none" stroke="currentColor" stroke-width="2" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path stroke-linecap="round" stroke-linejoin="round" d="M7 16a4 4 0 01-.88-7.903A5 5 0 1115.9 6L16 6a5 5 0 011 9.9M9 19l3 3m0 0l3-3m-3 3V10"></path></svg>
        Update Firmware
      </h3>
      <div class="firmware-grid">
        <div>
          <div class="subsection-title">GitHub OTA & Target Mesin</div>
          <form id="form-folder">
            <div class="form-group">
              <label>Pilih Target Board (Folder GitHub)</label>
              <select name="folder_name" class="form-control">
                <option value="ESP32main" {{SEL_ESP32MAIN}}>Mesin ESP32 (ESP32main)</option>
                <option value="ESP32_test" {{SEL_ESP32TEST}}>Mesin ESP32 Test (ESP32_test)</option>
                <option value="WT32main" {{SEL_WT32MAIN}}>Mesin WT32 (WT32main)</option>
                <option value="WT32_test" {{SEL_WT32TEST}}>Mesin WT32 Test (WT32_test)</option>
                <option value="src_mainOTA" {{SEL_SRCMAINOTA}}>Main OTA (src_mainOTA)</option>
              </select>
            </div>
            <button type="submit" class="btn" style="margin-bottom:10px;">Simpan Target & Restart</button>
          </form>
          <button class="btn btn-secondary" onclick="window.location.href='/cek_update'">📥 Cek Update GitHub Sekarang</button>
        </div>
        <div class="firmware-divider">
          <div class="subsection-title">Upload Firmware Manual (.bin)</div>
          <form id="form-upload">
            <div class="form-group">
              <label>Pilih File Firmware .bin</label>
              <div class="file-input-wrapper">
                <input type="file" name="update" id="file-input" accept=".bin">
                <span class="file-input-text" id="file-name-display">Seret file ke sini atau klik untuk memilih</span>
              </div>
            </div>
            <button type="submit" class="btn">Upload & Flash</button>
          </form>
          <div class="progress-container" id="progress-container">
            <div class="progress-track">
              <div class="progress-bar" id="progress-bar"></div>
            </div>
            <div class="progress-info">
              <span id="progress-status">Menyiapkan...</span>
              <span id="progress-percent">0%</span>
            </div>
          </div>
        </div>
      </div>
    </div>

    <!-- Card 3: Pengaturan -->
    <div class="card">
      <h3 class="card-title">
        <svg fill="none" stroke="currentColor" stroke-width="2" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><path stroke-linecap="round" stroke-linejoin="round" d="M10.325 4.317c.426-1.756 2.924-1.756 3.35 0a1.724 1.724 0 002.573 1.066c1.543-.94 3.31.826 2.37 2.37a1.724 1.724 0 001.065 2.572c1.756.426 1.756 2.924 0 3.35a1.724 1.724 0 00-1.066 2.573c.94 1.543-.826 3.31-2.37 2.37a1.724 1.724 0 00-2.572 1.065c-.426 1.756-2.924 1.756-3.35 0a1.724 1.724 0 00-2.573-1.066c-1.543.94-3.31-.826-2.37-2.37a1.724 1.724 0 00-1.065-2.572c-1.756-.426-1.756-2.924 0-3.35a1.724 1.724 0 001.066-2.573c-.94-1.543.826-3.31 2.37-2.37.996.608 2.296.07 2.572-1.065z"></path><path stroke-linecap="round" stroke-linejoin="round" d="M15 12a3 3 0 11-6 0 3 3 0 016 0z"></path></svg>
        Pengaturan
      </h3>
      <div class="settings-grid">
        <div>
          <div class="subsection-title">Kartu Master (Bypass)</div>
          <form id="form-master">
            <div class="form-group">
              <label>UID Kartu Master</label>
              <input type="text" name="rfid_master" class="form-control" placeholder="A166C820" value="{{RFID_MASTER}}" required>
            </div>
            <button type="submit" class="btn">Simpan Master & Restart</button>
          </form>
        </div>
        <div class="section-divider">
          <div class="subsection-title">Pengaturan MQTT Broker</div>
          <form id="form-mqtt">
            <div class="form-group">
              <label>IP Server Broker</label>
              <input type="text" name="mqtt_server" class="form-control" placeholder="192.168.1.50" value="{{MQTT_SERVER}}" required>
            </div>
            <div class="form-group">
              <label>Port Broker</label>
              <input type="number" name="mqtt_port" class="form-control" placeholder="1883" value="{{MQTT_PORT}}" required>
            </div>
            <div class="form-group">
              <label>Username MQTT</label>
              <input type="text" name="mqtt_user" class="form-control" value="{{MQTT_USER}}">
            </div>
            <div class="form-group">
              <label>Password MQTT</label>
              <input type="password" name="mqtt_pass" class="form-control" value="{{MQTT_PASS}}">
            </div>
            <div class="form-group">
              <label>Client ID (Device ID)</label>
              <input type="text" name="mqtt_client_id" class="form-control" value="{{MQTT_CLIENT_ID}}" required>
            </div>
            <div class="form-group">
              <label>Tipe Device</label>
              <select name="device_type" class="form-control" id="sel-device-type">
                <option value="gate" {{SEL_DEVICE_GATE}}>Gate (Gerbang)</option>
                <option value="kasir" {{SEL_DEVICE_KASIR}}>Kasir</option>
              </select>
            </div>
            <div class="form-group">
              <label>Topic MQTT Aktif</label>
              <div style="background:rgba(0,0,0,0.3);border:1px solid var(--border-color);border-radius:6px;padding:8px 10px;">
                <div style="font-size:11.5px;margin-bottom:4px;"><span style="color:#9ca3af;">📤 Publish:</span> <span class="mono" style="color:#10b981;">{{TOPIC_PUB}}</span></div>
                <div style="font-size:11.5px;"><span style="color:#9ca3af;">📥 Subscribe:</span> <span class="mono" style="color:#a5b4fc;">{{TOPIC_SUB}}</span></div>
              </div>
            </div>
            <button type="submit" class="btn">Simpan MQTT & Restart</button>
          </form>
        </div>
      </div>
    </div>
  </div>

  <!-- Loading Overlay -->
  <div class="overlay" id="overlay">
    <div class="spinner"></div>
    <h2 id="overlay-title">Memproses...</h2>
    <p id="overlay-subtitle">Menghubungi board ESP32 kembali dalam <span id="overlay-countdown">--</span></p>
  </div>

  <!-- Toast -->
  <div class="toast" id="toast">Gerbang Terbuka!</div>

  <script>
    function updateUI(data) {
      document.getElementById('version-text').innerText = data.version;
      document.getElementById('folder-badge').innerText = data.folder;
      document.getElementById('free-heap').innerText = data.free_heap.toLocaleString() + ' Bytes';
      document.getElementById('min-free-heap').innerText = data.min_free_heap.toLocaleString() + ' Bytes';

      // Format Uptime
      let uptimeSec = data.uptime;
      let hrs = Math.floor(uptimeSec / 3600);
      let mins = Math.floor((uptimeSec % 3600) / 60);
      let secs = uptimeSec % 60;
      document.getElementById('uptime').innerText = (hrs > 0 ? hrs + 'j ' : '') + mins + 'm ' + secs + 's';

      // RFID Status UI
      let rfidVal = document.getElementById('rfid-status-val');
      let rfidInd = document.getElementById('rfid-status-ind');
      rfidVal.innerText = data.rfid_status;
      if (data.rfid_status.indexOf('✅') !== -1) {
        rfidVal.className = 'status-value text-green';
        rfidInd.className = 'status-indicator indicator-green';
      } else {
        rfidVal.className = 'status-value text-red';
        rfidInd.className = 'status-indicator indicator-red';
      }
      document.getElementById('rfid-version').innerText = data.rfid_version;
      document.getElementById('last-rfid').innerText = data.last_rfid || 'Belum ada kartu';
      document.getElementById('last-barcode').innerText = data.last_barcode || 'Belum ada barcode';

      // WiFi UI
      let wifiVal = document.getElementById('wifi-status-val');
      let wifiInd = document.getElementById('wifi-status-ind');
      let wifiCon = (data.wifi_status === 'Connected');
      wifiVal.innerText = wifiCon ? '✅ Terhubung' : '❌ Terputus';
      if (wifiCon) {
        wifiVal.className = 'status-value text-green';
        wifiInd.className = 'status-indicator indicator-green';
      } else {
        wifiVal.className = 'status-value text-red';
        wifiInd.className = 'status-indicator indicator-red';
      }
      document.getElementById('wifi-ssid').innerText = data.wifi_ssid || '-';
      document.getElementById('wifi-rssi').innerText = data.wifi_rssi ? data.wifi_rssi + ' dBm' : '-';
      document.getElementById('wifi-ip').innerText = data.wifi_ip;

      // MQTT UI
      let mqttVal = document.getElementById('mqtt-status-val');
      let mqttInd = document.getElementById('mqtt-status-ind');
      let mqttCon = (data.mqtt_status === 'Connected');
      mqttVal.innerText = mqttCon ? '✅ Terhubung' : '⚠️ Offline';
      if (mqttCon) {
        mqttVal.className = 'status-value text-green';
        mqttInd.className = 'status-indicator indicator-green';
      } else {
        mqttVal.className = 'status-value text-orange';
        mqttInd.className = 'status-indicator indicator-orange';
      }
      document.getElementById('mqtt-broker').innerText = data.mqtt_broker + ':' + data.mqtt_port;
      document.getElementById('mqtt-client-id').innerText = data.mqtt_client_id;
      document.getElementById('device-type-val').innerText = (data.device_type || '-').toUpperCase();
      document.getElementById('topic-pub-val').innerText = data.mqtt_topic_pub || '-';
      document.getElementById('topic-sub-val').innerText = data.mqtt_topic_sub || '-';
      let touchEl = document.getElementById('touch-status-val');
      if (data.touch_active) {
        touchEl.innerText = '⚠️ DISENTUH — segera reset!';
        touchEl.className = 'status-value mono text-orange';
      } else {
        touchEl.innerText = 'GPIO4 — tahan 10 dtk';
        touchEl.className = 'status-value mono text-muted';
      }

      // Relays UI
      let r1 = document.getElementById('r1-status');
      r1.innerText = data.relay1 ? '✅ AKTIF (Pulse)' : '⚡ STANDBY';
      r1.className = data.relay1 ? 'status-value text-green' : 'status-value text-muted';

      let r2 = document.getElementById('r2-status');
      r2.innerText = data.relay2 ? '✅ AKTIF (Pulse)' : '⚡ STANDBY';
      r2.className = data.relay2 ? 'status-value text-green' : 'status-value text-muted';
    }

    function fetchStatus() {
      fetch('/status_data?t=' + Date.now())
        .then(res => res.json())
        .then(data => updateUI(data))
        .catch(err => console.error('Error fetching status data:', err));
    }

    setInterval(fetchStatus, 1500);
    fetchStatus();

    function showToast(message, isSuccess = true) {
      let toast = document.getElementById('toast');
      toast.innerText = message;
      toast.style.borderColor = isSuccess ? 'var(--success)' : 'var(--danger)';
      toast.className = 'toast show';
      setTimeout(() => { toast.className = 'toast'; }, 3000);
    }

    function showOverlay(title, subtitle, seconds) {
      let overlay = document.getElementById('overlay');
      let titleEl = document.getElementById('overlay-title');
      let subtitleEl = document.getElementById('overlay-subtitle');
      let countdown = document.getElementById('overlay-countdown');

      titleEl.innerText = title;
      subtitleEl.innerHTML = subtitle + ' kembali dalam <span id="overlay-countdown"></span>';
      
      overlay.style.display = 'flex';
      let rem = seconds;
      
      let el = document.getElementById('overlay-countdown');
      el.innerText = rem + ' detik...';

      let iv = setInterval(() => {
        rem--;
        if (rem <= 0) {
          clearInterval(iv);
          window.location.href = '/';
        } else {
          el.innerText = rem + ' detik...';
        }
      }, 1000);
    }

    function reconnectWifi() {
      fetch('/reconnect_wifi')
        .then(() => showToast('Mencoba menghubungkan ulang WiFi...'))
        .catch(() => showToast('Gagal mengirim perintah', false));
    }

    function forgetWifi() {
      if (confirm('Yakin ingin menghapus WiFi? Alat akan restart ke mode setup Hotspot.')) {
        fetch('/forget_wifi')
          .then(() => showOverlay('Menghapus WiFi', 'Alat akan restart dan masuk ke mode Setup (Wanara_Gate_Setup)', 15))
          .catch(() => showToast('Gagal mereset WiFi', false));
      }
    }

    function triggerRelay(num) {
      let r = document.getElementById('r' + num + '-status');
      if (r) {
        r.innerText = '⏳ MENGIRIM...';
        r.className = 'status-value text-orange';
      }
      fetch('/trigger_relay?relay=' + num + '&t=' + Date.now())
        .then(res => {
          if (res.ok) {
            showToast('Relay ' + num + ' Berhasil Dipicu!');
            if (r) {
              r.innerText = num === 1 ? '✅ DIPICU' : '🔔 DIPICU';
              r.className = num === 1 ? 'status-value text-green' : 'status-value text-orange';
            }
          } else {
            showToast('Gagal memicu relay', false);
            if (r) {
              r.innerText = '❌ GAGAL';
              r.className = 'status-value text-red';
            }
          }
        })
        .catch(() => showToast('Error komunikasi', false));
    }

