cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32main/main.cpp
    function rebootDevice() {
      if (confirm('Merestart board ESP32?')) {
        fetch('/reboot')
          .then(() => showOverlay('Rebooting Device', 'Mencoba menghubungi board', 10))
          .catch(() => showToast('Gagal memproses reboot', false));
      }
    }

    document.getElementById('form-folder').addEventListener('submit', function(e) {
      e.preventDefault();
      fetch('/save_folder', {
        method: 'POST',
        body: new URLSearchParams(new FormData(this))
      })
      .then(() => showOverlay('Mengubah Target Folder', 'Merestart board untuk memuat setelan', 8))
      .catch(() => showToast('Gagal merubah folder', false));
    });

    document.getElementById('form-mqtt').addEventListener('submit', function(e) {
      e.preventDefault();
      fetch('/save_mqtt', {
        method: 'POST',
        body: new URLSearchParams(new FormData(this))
      })
      .then(() => showOverlay('Menyimpan MQTT Broker', 'Menerapkan setelan broker baru', 8))
      .catch(() => showToast('Gagal menyimpan MQTT', false));
    });

    document.getElementById('form-master').addEventListener('submit', function(e) {
      e.preventDefault();
      fetch('/save_master', {
        method: 'POST',
        body: new URLSearchParams(new FormData(this))
      })
      .then(() => showOverlay('Menyimpan Kartu Master', 'Menerapkan UID kartu master baru', 8))
      .catch(() => showToast('Gagal menyimpan kartu master', false));
    });



    document.getElementById('file-input').addEventListener('change', function() {
      let label = this.files.length > 0 ? this.files[0].name : 'Seret file ke sini atau klik untuk memilih';
      document.getElementById('file-name-display').innerText = label;
    });

    document.getElementById('form-upload').addEventListener('submit', function(e) {
      e.preventDefault();
      let fileInput = document.getElementById('file-input');
      if (fileInput.files.length === 0) {
        showToast('Pilih file .bin terlebih dahulu!', false);
        return;
      }
      if (!confirm('Apakah Anda yakin ingin meng-upload dan men-flash file ini secara manual?')) {
        return;
      }

      let file = fileInput.files[0];
      let formData = new FormData();
      formData.append('update', file);

      let xhr = new XMLHttpRequest();
      xhr.open('POST', '/update', true);

      let container = document.getElementById('progress-container');
      let bar = document.getElementById('progress-bar');
      let percentText = document.getElementById('progress-percent');
      let statusText = document.getElementById('progress-status');

      container.style.display = 'block';
      statusText.innerText = 'Mengunggah file...';
      bar.style.width = '0%';
      percentText.innerText = '0%';

      xhr.upload.addEventListener('progress', function(event) {
        if (event.lengthComputable) {
          let percent = Math.round((event.loaded / event.total) * 100);
          bar.style.width = percent + '%';
          percentText.innerText = percent + '%';
          if (percent === 100) {
            statusText.innerText = 'Menulis ke Flash... (Jangan Matikan Board)';
          }
        }
      });

      xhr.onreadystatechange = function() {
        if (xhr.readyState === 4) {
          if (xhr.status === 200) {
            statusText.innerText = 'Flash Berhasil! Board merestart...';
            showOverlay('Update Manual Berhasil', 'Firmware baru terpasang, board sedang reboot', 10);
          } else {
            statusText.innerText = 'Gagal: ' + xhr.responseText;
            showToast('Gagal meng-upload firmware: ' + xhr.responseText, false);
          }
        }
      };
      xhr.send(formData);
    });
  </script>
</body>
</html>
)rawliteral";

void handleRoot() {
  server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
  server.sendHeader("Pragma", "no-cache");
  server.sendHeader("Expires", "-1");

  String html = String(INDEX_HTML);
  
  // Replace string template saat dimuat pertama kali
  html.replace("{{VERSION}}", APP_VERSION);
  html.replace("{{FOLDER}}", folderAktif);
  html.replace("{{SEL_ESP32MAIN}}", folderAktif == "ESP32main" ? "selected" : "");
  html.replace("{{SEL_ESP32TEST}}", folderAktif == "ESP32_test" ? "selected" : "");
  html.replace("{{SEL_WT32MAIN}}", folderAktif == "WT32main" ? "selected" : "");
  html.replace("{{SEL_WT32TEST}}", folderAktif == "WT32_test" ? "selected" : "");
  html.replace("{{SEL_SRCMAINOTA}}", folderAktif == "src_mainOTA" ? "selected" : "");

  html.replace("{{MQTT_SERVER}}", mqtt_server);
  html.replace("{{MQTT_PORT}}", String(mqtt_port));
  html.replace("{{MQTT_USER}}", mqtt_user);
  html.replace("{{MQTT_PASS}}", mqtt_pass);
  html.replace("{{MQTT_CLIENT_ID}}", mqtt_client_id);
  html.replace("{{RFID_MASTER}}", rfid_master);
  html.replace("{{SEL_DEVICE_GATE}}", device_type == "gate" ? "selected" : "");
  html.replace("{{SEL_DEVICE_KASIR}}", device_type == "kasir" ? "selected" : "");

  html.replace("{{TOPIC_PUB}}", device_type + "/" + mqtt_client_id + "/scan/in");
  html.replace("{{TOPIC_SUB}}", device_type + "/" + mqtt_client_id + "/result");

  server.send(200, "text/html", html);
}

void handleStatusData() {
  server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
  server.sendHeader("Pragma", "no-cache");
  server.sendHeader("Expires", "-1");

  JsonDocument doc;
  doc["version"]       = APP_VERSION;
  doc["folder"]        = folderAktif;
  doc["free_heap"]     = ESP.getFreeHeap();
  doc["min_free_heap"] = ESP.getMinFreeHeap();
  doc["uptime"]        = millis() / 1000;
  doc["rfid_status"]   = rfidStatus;

  byte v = mfrc522.PCD_ReadRegister(mfrc522.VersionReg);
  char verStr[10];
  sprintf(verStr, "0x%02X", v);
  doc["rfid_version"]  = verStr;
  doc["last_rfid"]     = lastRfidScan;
  doc["last_barcode"]  = lastBarcodeScan;

  bool wifiCon = (WiFi.status() == WL_CONNECTED);
  doc["wifi_status"]   = wifiCon ? "Connected" : "Disconnected";
  doc["wifi_ssid"]     = wifiCon ? WiFi.SSID() : (wm.getWiFiIsSaved() ? WiFi.SSID() : "-");
  doc["wifi_rssi"]     = wifiCon ? String(WiFi.RSSI()) : "0";
  doc["wifi_ip"]       = WiFi.localIP().toString();

  doc["mqtt_status"]   = mqttClient.connected() ? "Connected" : "Disconnected";
  doc["mqtt_broker"]   = mqtt_server;
  doc["mqtt_port"]     = mqtt_port;
  doc["mqtt_client_id"]= mqtt_client_id;
  doc["relay1"]        = isRelay1Active;
  doc["relay2"]        = isRelay2Active;
  doc["device_type"]   = device_type;
  doc["mqtt_topic_pub"]= device_type + "/" + mqtt_client_id + "/scan/in";
  doc["mqtt_topic_sub"]= device_type + "/" + mqtt_client_id + "/result";
  doc["touch_active"]  = isTouching;

  String output;
  serializeJson(doc, output);
  server.send(200, "application/json", output);
}

void handleReconnectWifi() {
  server.send(200, "text/plain", "Reconnecting");
  if (wm.getWiFiIsSaved()) {
    Serial.println("[WIFI] Perintah reconnect manual via Web...");
    WiFi.disconnect();
    WiFi.begin(); // Reconnect pakai kredensial tersimpan
  }
}

void handleForgetWifi() {
  server.send(200, "text/plain", "OK");
  Serial.println("[WIFI] Perintah Forget WiFi diterima. Menghapus kredensial...");
  delay(1000);
  wm.resetSettings(); // Menghapus SSID & Password dari NVS ESP32
  esp_task_wdt_delete(NULL); 
  ESP.restart();
}

void handleSaveFolder() {
  if (server.hasArg("folder_name")) {
    String newFolder = server.arg("folder_name");
    preferences.begin("gate_config", false);
    preferences.putString("ota_folder", newFolder);
    preferences.end();

    server.send(200, "text/plain", "OK");
    pendingRestart = true;
    restartTime = millis();
  } else {
    server.send(400, "text/plain", "Bad Request");
  }
}

