cloudrisenx/wanaraseta_gate/wanaraseta_gate/ESP32main/main.cpp
  // Setup Pin Relay sebagai Output
  pinMode(RELAY1_PIN, OUTPUT);
  pinMode(RELAY2_PIN, OUTPUT);
  digitalWrite(RELAY1_PIN, RELAY_DEACTIVE);
  digitalWrite(RELAY2_PIN, RELAY_DEACTIVE);

  // Setup Pin LED RFID sebagai Output
  pinMode(RFID_LED_PIN, OUTPUT);
  digitalWrite(RFID_LED_PIN, LOW); // Default mati (asumsi Active-HIGH)
}

void loop() {
  server.handleClient(); // Jaga agar server web tetap responsif

  // Touch Pin - Deteksi tahan 10 detik untuk masuk ulang ke WiFi Manager
  {
    uint16_t touchVal = touchRead(TOUCH_PIN);
    if (touchVal < TOUCH_THRESHOLD) {
      if (!isTouching) {
        isTouching = true;
        touchStartTime = millis();
        Serial.println("[TOUCH] GPIO4 disentuh! Tahan 10 detik untuk reset WiFi Manager...");
      } else if (millis() - touchStartTime >= 10000) {
        Serial.println("[TOUCH] 10 detik tercapai! Mereset WiFi Manager dan restart...");
        isTouching = false;
        wm.resetSettings();
        esp_task_wdt_delete(NULL);
        delay(500);
        ESP.restart();
      }
    } else {
      if (isTouching && (millis() - touchStartTime > 500)) {
        Serial.printf("[TOUCH] Dilepas setelah %lums (butuh 10000ms untuk reset)\n", millis() - touchStartTime);
      }
      isTouching = false;
      touchStartTime = 0;
    }
  }

  // Tangani restart tertunda agar respon HTTP terkirim bersih ke browser
  if (pendingRestart && (millis() - restartTime > 2000)) {
    ESP.restart();
  }

  // Status Koneksi
  bool wifiConnected = (WiFi.status() == WL_CONNECTED);
  bool mqttConnected = mqttClient.connected();

  static int wifiReconnectAttempts = 0;
  static unsigned long lastWifiCheck = 0;
  static unsigned long timeAfterFiveAttempts = 0;

  if (wifiConnected) {
    wifiReconnectAttempts = 0;
    timeAfterFiveAttempts = 0;
  }

  // --- LOGIKA RECONNECT WIFI ---
  if (!wifiConnected) {
    // Coba reconnect setiap 10 detik maksimal 5 kali percobaan
    if (millis() - lastWifiCheck > 10000 && wifiReconnectAttempts < 5) {
      lastWifiCheck = millis();
      if (wm.getWiFiIsSaved()) {
        wifiReconnectAttempts++;
        Serial.printf("[WIFI] Terputus! Mencoba menghubungkan ulang ke router... (Percobaan %d/5)\n", wifiReconnectAttempts);
        WiFi.disconnect();
        WiFi.begin(); 
        
        if (wifiReconnectAttempts == 5) {
          timeAfterFiveAttempts = millis(); // Catat waktu setelah percobaan ke-5 selesai
        }
      }
    }
  }

  // --- LOGIKA WATCHDOG TIMER (WDT) ---
  bool feedWDT = true;

  if (wm.getWiFiIsSaved()) {
    // Jika WiFi terputus, sudah 5 kali percobaan, biarkan timeout 1 menit sebelum WDT reset board
    if (!wifiConnected && wifiReconnectAttempts >= 5 && timeAfterFiveAttempts > 0) {
      if (millis() - timeAfterFiveAttempts > 60000) {
        feedWDT = false;
      }
    }
  }

  if (feedWDT) {
    esp_task_wdt_reset(); // Beri makan watchdog
  }

  // --- LOGIKA RECONNECT MQTT ---
  if (wifiConnected) {
    if (!mqttConnected) {
      // Coba reconnect tiap 5 detik tanpa peduli WDT
      if (millis() - lastMqttReconnectAttempt > 5000) {
        lastMqttReconnectAttempt = millis();
        reconnectMQTT();
      }
    } else {
      mqttClient.loop();
    }
  }

  // Logika Pembacaan Barcode (UART2)
  if (Serial2.available()) {
    String barcodeData = Serial2.readStringUntil('\r');
    barcodeData.trim();
    if (barcodeData.length() > 0) {
      Serial.println("[BARCODE] Terdeteksi: " + barcodeData);

      unsigned long nowBarcode       = millis();
      bool isSameBarcode             = (barcodeData == lastScannedBarcode);
      bool withinBarcodeCooldown     = (nowBarcode - lastBarcodeTime < COOLDOWN_SAME_BARCODE_MS);

      if (isSameBarcode && withinBarcodeCooldown) {
        Serial.println("[BARCODE] Cooldown aktif, scan diabaikan.");
      } else {
        lastScannedBarcode = barcodeData;
        lastBarcodeTime    = nowBarcode;
        lastBarcodeScan    = barcodeData;

        if (wifiConnected && mqttClient.connected()) {
          String payload = "{\"barcode\":\"" + barcodeData + "\", \"device_id\":\"" + mqtt_client_id + "\"}";
          String pubTopic = device_type + "/" + mqtt_client_id + "/scan/in";
          if (mqttClient.publish(pubTopic.c_str(), payload.c_str())) {
            Serial.println("[MQTT] Barcode sukses terkirim.");
          } else {
            Serial.println("[MQTT] Barcode gagal terkirim!");
          }
        }
      }
    }
  }

  // Tangani Re-inisialisasi RFID Non-Blocking akibat EMI Relay
  if (pendingRfidReinit && (millis() - pendingRfidReinitTime > 50)) {
    pendingRfidReinit = false;
    mfrc522.PCD_Init();
    mfrc522.PCD_SetAntennaGain(mfrc522.RxGain_max);
  }

  // Logika Pembacaan & Health-Check Sensor RFID (dilewati jika scanner_type = "qr")
  static unsigned long lastRFIDReadTime = 0;
  static unsigned long lastRfidHealthCheck = 0;
  static unsigned long lastPeriodicRfidReinit = 0;

  // Health-check berkala setiap 5 detik
  if (millis() - lastRfidHealthCheck > 5000) {
    lastRfidHealthCheck = millis();
    byte v = mfrc522.PCD_ReadRegister(mfrc522.VersionReg);
    if (v == 0x00 || v == 0xFF) {
      Serial.println("[RFID] Sensor hang/terputus! Melakukan hard reset...");
      
      // Hardware Reset Pulsa via RST Pin
      digitalWrite(RST_PIN, LOW);
      pinMode(RST_PIN, OUTPUT);
      delay(20);
      digitalWrite(RST_PIN, HIGH);
      delay(50);
      
      // Reset SPI bus
      SPI.end();
      SPI.begin(SPI_SCK, SPI_MISO, SPI_MOSI);
      
      mfrc522.PCD_Init();
      mfrc522.PCD_SetAntennaGain(mfrc522.RxGain_max);
      delay(50);
      
      v = mfrc522.PCD_ReadRegister(mfrc522.VersionReg);
      if (v != 0x00 && v != 0xFF) {
        rfidStatus = "✅ AKTIF (Dipulihkan)";
        Serial.printf("[RFID] Sensor pulih! Versi: 0x%02X\n", v);
      } else {
        rfidStatus = "❌ TIDAK MERESPON (Hang)";
        Serial.println("[RFID] Pemulihan gagal. Cek kabel.");
      }
    } else {
      if (rfidStatus.indexOf("✅") == -1) {
        rfidStatus = "✅ AKTIF";
      }
    }
  }

  // Soft-reset register berkala setiap 30 detik untuk memulihkan register yang ter-corrupt noise
  if (millis() - lastPeriodicRfidReinit > 30000) {
    lastPeriodicRfidReinit = millis();
    mfrc522.PCD_Init();
    mfrc522.PCD_SetAntennaGain(mfrc522.RxGain_max);
  }

  // Proses scan kartu RFID
  if (mfrc522.PICC_IsNewCardPresent()) {
    if (mfrc522.PICC_ReadCardSerial()) {
      String rfidUid = "";
      for (byte i = 0; i < mfrc522.uid.size; i++) {
        rfidUid += String(mfrc522.uid.uidByte[i] < 0x10 ? "0" : "");
        rfidUid += String(mfrc522.uid.uidByte[i], HEX);
      }
      rfidUid.toUpperCase();

      unsigned long now = millis();
      
      // Cooldown logic cerdas
      bool isSameCard = (rfidUid == lastScannedUid);
      bool withinSameCardCooldown = (now - lastScannedTime < COOLDOWN_SAME_CARD_MS);
      bool withinAnyCardCooldown = (now - lastScannedTime < COOLDOWN_ANY_CARD_MS);

      if (isSameCard && withinSameCardCooldown) {
        // Abaikan agar tidak terjadi double-scan kartu yang sama
        mfrc522.PICC_HaltA();
        mfrc522.PCD_StopCrypto1();
      } else if (withinAnyCardCooldown) {
        // Abaikan karena terlalu cepat dari scan sebelumnya
        mfrc522.PICC_HaltA();
        mfrc522.PCD_StopCrypto1();
      } else {
        // Proses Validasi Kartu
        lastScannedUid  = rfidUid;
        lastScannedTime = now;
        lastRfidScan    = rfidUid;
        Serial.println("[RFID] Kartu Terdeteksi: " + rfidUid);

        // Nyalakan LED Indikator
        isRfidLedActive = true;
        rfidLedActiveTime = millis();
        digitalWrite(RFID_LED_PIN, HIGH);

        // Bypass jika master card
        if (rfidUid == rfid_master) {
          Serial.println("[MASTER] Master Card terdeteksi! Bypass buka gerbang.");
          triggerRelay(1);
        } else {
          // Kirim data scan ke MQTT Broker
          if (wifiConnected && mqttClient.connected()) {
            String payload = "{\"rfid\":\"" + rfidUid + "\", \"device_id\":\"" + mqtt_client_id + "\"}";
            String pubTopic = device_type + "/" + mqtt_client_id + "/scan/in";
            if (mqttClient.publish(pubTopic.c_str(), payload.c_str())) {
              Serial.println("[MQTT] Data scan terkirim ke EMQX.");
            } else {
              Serial.println("[MQTT] Gagal mengirim data scan!");
            }
          } else {
            Serial.println("[MQTT] Offline, data scan tidak dikirim.");
          }
        }

        mfrc522.PICC_HaltA();
        mfrc522.PCD_StopCrypto1();
      }
    } else {
      // Gagal membaca serial kartu (misalnya karena terganggu noise relay).
      // Bersihkan state kartu dan soft reset reader agar tidak stuck.
      mfrc522.PICC_HaltA();
      mfrc522.PCD_StopCrypto1();
      mfrc522.PCD_Init();
      mfrc522.PCD_SetAntennaGain(mfrc522.RxGain_max);
    }
  }

  // Tangani timer matikan LED Indikator RFID otomatis
  if (isRfidLedActive && (millis() - rfidLedActiveTime > RFID_LED_ON_MS)) {
    isRfidLedActive = false;
    digitalWrite(RFID_LED_PIN, LOW);
  }

  // Tangani timer penutupan gerbang otomatis
  handleGate();
}